// Task 02

// Створіть анонімний модуль, який реалізує функцію, що отримує три цілі числа та повертає найбільше з них. 
// Якщо всі числа однакові — функція повертає будь-яке з них. Використовуйте синтаксис CommonJS.

// У цьому та подальших завданнях діє правило FairPlay — під час перевірки завжди передаватимуться всі аргументи, 
// і вони будуть цілими числами (для цього завдання).

// Якщо буде потрібно додавати додаткові перевірки — це буде вказано в умові.

module.exports = function getMaxOfThree(a, b, c) {
    return Math.max(a, b, c);
}
