// Task 04

// Створіть іменований модуль prepareString, який отримує рядок, видаляє пробіли на початку та в кінці, переводить текст у нижній регістр і робить першу літеру великою.
// Модуль повинен повертати опрацьований рядок. Використовуйте синтаксис CommonJS.

// Ці дії дуже корисні під час обробки інформації перед збереженням у базу даних,
// наприклад, під час збереження імен. Подумайте, які додаткові вимоги ви б додали до цього завдання в реальному проєкті.

exports.prepareString = function (str) {
    if (typeof str !== 'string') {
        throw new TypeError('Input must be a string');
    }

    str = str.trim().toLowerCase();

    if (str.length === 0) {
        return '';
    }

    return str.charAt(0).toUpperCase() + str.slice(1);
}
